<a href="https://colab.research.google.com/github/mpanuluh/dibimbing-13A/blob/main/Assignment_DS_D7_Mahatma_Abiyoso_Panuluh.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Assignment Data Science Day 7
1. Tim data scientist diminta pertolongan oleh CEO ingin meminta beberapa data terkait user.
Sehingga tim data scientist diminta membuat data frame dari profil user tersebut. Silahkan buat
data frame yang terdiri dari kolom berikut:
  1. Nama
  2. Tempat lahir
  3. Tanggal lahir
  4. Tanggal terakhir berbelanja
  5. Rata-rata amount belanja per bulan (Rp)
  6. Total transaksi per bulan

  Buatlah data minimal 5 users.
2. Dari data frame tersebut pilihlah user yang paling loyal berbelanja. Dimana user loyal adalah user yang memiliki rata-rata amount belanja per bulan di atas 100 ribu rupiah dan total transaksi per bulan di atas 5.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
#1. Membuat sebuah data frame pelanggan dari kolom yang sudah ditentukan
# Tulis semua kolom dan data yang diperlukan dalam sebuah data frame
df=pd.DataFrame({
    'nama':['Abi', 'Bobi','Coki', 'Debi', 'Eki', 'Febi','Gigi','Hori','Indi','Jati'],
    'tempat_lahir':['Alexandria','Bandung','California','Delhi','Esmeraldas','Fukuyama','Gotham','Hamburg', 'Islamabad','Jerusalem'],
    'tanggal_lahir':['27/08/90','28/08/91','29/08/92','30/08/93','31/08/94','01/09/95','02/09/96','03/09/97','04/09/98','05/09/99'],
    'belanja_terakhir':['27/08/21','28/08/21','29/08/21','30/08/21','31/08/21','01/09/21','02/09/21','03/09/21','04/09/21','05/09/21'],
    'rata2_belanja': [500000,400000,300000,200000,90000,80000,70000,60000,600000,40000],
    'total_transaksi': [10,5,8,7,6,9,4,3,2,3],
})

df

   nama tempat_lahir  ... rata2_belanja total_transaksi
0   Abi   Alexandria  ...        500000              10
1  Bobi      Bandung  ...        400000               5
2  Coki   California  ...        300000               8
3  Debi        Delhi  ...        200000               7
4   Eki   Esmeraldas  ...         90000               6
5  Febi     Fukuyama  ...         80000               9
6  Gigi       Gotham  ...         70000               4
7  Hori      Hamburg  ...         60000               3
8  Indi    Islamabad  ...        600000               2
9  Jati    Jerusalem  ...         40000               3

[10 rows x 6 columns]

In [ ]:
# 2. Memilih user paling loyal (rata2 belanha>100000&total transaksi>5)

df[(df.rata2_belanja>100000)&(df.total_transaksi>5)]

   nama tempat_lahir  ... rata2_belanja total_transaksi
0   Abi   Alexandria  ...        500000              10
2  Coki   California  ...        300000               8
3  Debi        Delhi  ...        200000               7

[3 rows x 6 columns]